# pandas

In [75]:
import numpy as np
import pandas as pd

In [76]:
label = ['a','b','c']

In [77]:
my_data=[10,20,30]

In [78]:
arr = np.array(my_data)

In [79]:
d = {'d':10,'c':14,'e':23}

In [80]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [81]:
pd.Series(data=my_data,index=label)

a    10
b    20
c    30
dtype: int64

In [82]:
#from array and array for labels
pd.Series(my_data,label)

a    10
b    20
c    30
dtype: int64

In [83]:
#from numpy
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [84]:
#from dict
pd.Series(d)

c    14
d    10
e    23
dtype: int64

In [85]:
#ps.Series(data=[sum,print,len])

SyntaxError: invalid syntax (<ipython-input-85-fb43ffe8e48e>, line 1)

In [86]:
ser1 = pd.Series([1,2,3,4],['USA','Russia','canada','asia'])

In [88]:
ser1

USA       1
Russia    2
canada    3
asia      4
dtype: int64

In [87]:
ser1['USA']

1

In [89]:
ser1[0]

1

In [90]:
ser1+ser1

USA       2
Russia    4
canada    6
asia      8
dtype: int64

In [91]:
from numpy.random import randn

In [92]:
np.random.seed(101)

In [93]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [94]:
randn(5,4)

array([[ 0.30266545,  1.69372293, -1.70608593, -1.15911942],
       [-0.13484072,  0.39052784,  0.16690464,  0.18450186],
       [ 0.80770591,  0.07295968,  0.63878701,  0.3296463 ],
       [-0.49710402, -0.7540697 , -0.9434064 ,  0.48475165],
       [-0.11677332,  1.9017548 ,  0.23812696,  1.99665229]])

In [95]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [96]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [97]:
type(df.W)

pandas.core.series.Series

In [98]:
type(df)

pandas.core.frame.DataFrame

In [99]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [100]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [101]:
df['new']=df['W']+5

In [102]:
df.drop('new',axis=1) #axis 1 ->>>>>>  axis - down

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [103]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  7.706850
B  0.651118 -0.319318 -0.848077  0.605965  5.651118
C -2.018168  0.740122  0.528813 -0.589001  2.981832
D  0.188695 -0.758872 -0.933237  0.955057  5.188695
E  0.190794  1.978757  2.605967  0.683509  5.190794

In [104]:
df.drop('new',axis=1,inplace=True)

In [105]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [106]:
 df.drop('E',axis=0,inplace=True)

In [107]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [108]:
df.shape

(4, 4)

In [109]:
df[['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872

In [110]:
#select rows

In [111]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [112]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [113]:
#two ways loc - label based; iloc = for numerical based index

In [114]:
df.loc['A','Y']

0.9079694464765431

In [115]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [116]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True

In [117]:
booldf = df > 0

In [118]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True

In [119]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057

In [120]:
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057

In [121]:
df['W'] > 0

A     True
B     True
C    False
D     True
Name: W, dtype: bool

In [122]:
df[df['W']> 0][['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
D  0.188695 -0.933237

In [123]:
df[(df['W'] > 0) & (df['Y'] >0)]

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

In [124]:
df[(df['W'] > 0) | (df['Y'] >0)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [125]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057

In [131]:

newind = "CA, WI, SC, NC".split()

In [129]:
df
#df["state"]=newind

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [132]:
newind

['CA,', 'WI,', 'SC,', 'NC']

In [133]:
df["states"]=newind

In [134]:
df.set_index("states") # not in place. add arg inplace=True

               W         X         Y         Z
states
CA,     2.706850  0.628133  0.907969  0.503826
WI,     0.651118 -0.319318 -0.848077  0.605965
SC,    -2.018168  0.740122  0.528813 -0.589001
NC      0.188695 -0.758872 -0.933237  0.955057

In [136]:
outside =["G1","G1","G1","G2","G2","G2"]
inside = [1,2,3,1,2,3]

In [148]:
hier_index = list(zip(outside,inside))

In [151]:
hier_index1 = pd.MultiIndex.from_tuples(heir_index)

In [153]:
hier_index1

MultiIndex(levels=[[u'G1', u'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [154]:
df = pd.DataFrame(randn(6,2),hier_index1,['A','B'])

In [155]:
df

             A         B
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

In [156]:
df.loc['G1']

          A         B
1 -0.993263  0.196800
2 -1.136645  0.000366
3  1.025984 -0.156598

In [157]:
df.loc['G1'].iloc[0]

A   -0.993263
B    0.196800
Name: 1, dtype: float64

In [159]:
df.index.names=['Groups','Num']

In [160]:
df

                   A         B
Groups Num
G1     1   -0.993263  0.196800
       2   -1.136645  0.000366
       3    1.025984 -0.156598
G2     1   -0.031579  0.649826
       2    2.154846 -0.610259
       3   -0.755325 -0.346419

In [163]:
df.loc['G2'].loc[2]['B']

-0.61025885582274142

In [164]:
df.xs('G1')

            A         B
Num
1   -0.993263  0.196800
2   -1.136645  0.000366
3    1.025984 -0.156598

In [165]:
df.xs(1,level='Num')

               A         B
Groups
G1     -0.993263  0.196800
G2     -0.031579  0.649826

In [166]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [167]:
df = pd.DataFrame(d)

In [168]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [169]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [171]:
df.dropna(axis=0,thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [172]:
df.fillna(value='filled value')

              A             B  C
0             1             5  1
1             2  filled value  2
2  filled value  filled value  3

In [173]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [175]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Venessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [176]:
df = pd.DataFrame(data)

In [177]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Venessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [178]:
df.groupby('Company')

In [179]:
bycomp = df.groupby('Company')

In [180]:
bycomp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [181]:
bycomp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [184]:
bycomp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [185]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [186]:
df.groupby('Company').describe()

                    Sales
Company
FB      count    2.000000
        mean   296.500000
        std     75.660426
        min    243.000000
        25%    269.750000
        50%    296.500000
        75%    323.250000
        max    350.000000
GOOG    count    2.000000
        mean   160.000000
        std     56.568542
        min    120.000000
        25%    140.000000
        50%    160.000000
        75%    180.000000
        max    200.000000
MSFT    count    2.000000
        mean   232.000000
        std    152.735065
        min    124.000000
        25%    178.000000
        50%    232.000000
        75%    286.000000
        max    340.000000

In [188]:
df.groupby('Company').describe().transpose()

Company    FB                                                         GOOG  \
        count   mean        std    min     25%    50%     75%    max count
Sales     2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0   2.0

Company         ...                  MSFT                                   \
          mean  ...      75%    max count   mean         std    min    25%
Sales    160.0  ...    180.0  200.0   2.0  232.0  152.735065  124.0  178.0

Company
           50%    75%    max
Sales    232.0  286.0  340.0

[1 rows x 24 columns]

In [189]:
df =pd.DataFrame({'col1':[1,2,3,4],
                 'col2':[444,555,666,444],
                 'col3':['abc','def','ghi','xyz']})

In [190]:
df['col2'].unique()

array([444, 555, 666])

In [191]:
df['col2'].nunique()

3

In [193]:
df[df['col1'] >2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [195]:
df[(df['col1'] >2) & (df['col2'] <700)]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [196]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [197]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [199]:
df.drop('col1',axis = 1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [201]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [202]:
df.columns

Index([u'col1', u'col2', u'col3'], dtype='object')

In [203]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [205]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [208]:
df.pivot_table(values='col2',index=['col3','col1'])

col3  col1
abc   1       444
def   2       555
ghi   3       666
xyz   4       444
Name: col2, dtype: int64